SoapAPI/src/test/resources/postAccount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.soap.tks.it.p.lodz.pl">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:postAccountRequest>
            <gs:firstname>Jan</gs:firstname>
            <gs:lastname>Testowy</gs:lastname>
            <gs:roleOfUser>Admin</gs:roleOfUser>
            <gs:isActive>true</gs:isActive>
            <gs:id>test1</gs:id>
            <gs:login>test123</gs:login>
            <gs:password>password</gs:password>
        </gs:postAccountRequest>
    </soapenv:Body>
</soapenv:Envelope>